import asyncio
import edge_tts

TEXT = """Привет... Это я ... Лорд Гармодон ... ну что ладно , повеселимся сегодня.
          Тут вам кое какое задание от меня ... Вам нужно создать машину времени, сгонять в прошлое
          найти артифакты, вернуться и спасти ваших друзей пока они не утонули, Хе Хе Хе. Мастер Йода,
          Привидение, Чу, бака и еще один, его я не запомнил, вечно болтал и крутился вокруг, в общем они в колодце и туда что то капает сверху, не уверен что это вода , но - Йооде нравится.
          У вас тик так тик так, неизвестно сколько времени . Вам нужно найти - машину времени, ключи от первых галактических ворот, 
          ключи от вторых галактических ворот, мармеладки... чтобы не проголодаться, обыграть галактическую обезьяну в тридцать три,
          Оскара  в шахматы и много чего еще - поторопитесь. Все подсказки у паспорту"""
async def main():
    communicate = edge_tts.Communicate(TEXT, "fr-FR-RemyMultilingualNeural",rate="+20%",pitch="-5Hz")
    await communicate.save("garmadon_1.mp3")
asyncio.run(main())